{
    "stories":{
        "featured":[
            {
                "author":"Cheri",
                "location":"Northville, MI",
                "title":"During the pandemic, God taught me...",
                "quote":"It's not my job to try to figure it out because it's more complicated than I'll ever know.",
                "body":"I saw a mom and two young kids in the grocery store a couple weeks ago. It was at the height of the fear around COVID but they weren't wearing masks and the mom wasn't wearing gloves. I overheard her say the kids were just wearing gloves because they thought it was fun. They weren't really social distancing either -- just doing their own thing, seemingly oblivious to the whole virus world. Most other people in the store were decked out in all the recommended gear and giving the mom a look of disbelief, sometimes even shaking their heads to each other as they passed her.\nWhen I saw this family, I wondered too. I ran through various scenarios -- single mom, no babysitter, no one to shop for her, maybe a medical reason not to wear a mask or gloves, or maybe disbelief or even disdain around the whole virus thing...there was really no way to know. I considered asking if there was a way I could help her family but she didn't seem too approachable.\nAnd that's when God reminded me that I will never know all of the things that are happening or have happened in a person's life to bring them to the moment we cross paths. Not just in this weird virus world but always. It's not my job to try to figure it out either because it's more complicated than I'll ever know. But God knows exactly what each of us needs in each moment. And instead of me trying to figure out people's stories, He reminded me that my job is to listen to any prompting He has for me about interacting with them or simply to be praying for them.\nThat's what I want to take forward from this pandemic time.\nGreat is our Lord, and abundant in power;\nhis understanding is beyond measure.\nPsalm 147:5"
            }
        ],
        "all":{
            
        }
    }
}